app/controllers/casein/information_controller.rb

SELECT  "information".* FROM "information"   ORDER BY title   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "information"
---
    def index
      @casein_page_title = 'Information'
  		@information = Information.order(sort_order(:title)).paginate :page => params[:page]

SELECT  "information".* FROM "information"  WHERE "information"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      @casein_page_title = 'View information'
      @information = Information.find params[:id]

INSERT INTO "information" ("body", "created_at", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
      @information = Information.new information_params

      if @information.save

SELECT  "information".* FROM "information"  WHERE "information"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "information" SET "image_url" = ?, "updated_at" = ? WHERE "information"."id" = 7
---
    def update
      @casein_page_title = 'Update information'

      @information = Information.find params[:id]

      if @information.update_attributes information_params

SELECT  "information".* FROM "information"  WHERE "information"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "information" WHERE "information"."id" = ?  [["id", 1]]
---
    def destroy
      @information = Information.find params[:id]

      @information.destroy