app/controllers/casein/news_controller.rb

SELECT  "news".* FROM "news"   ORDER BY title   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "news"
---
    def index
      @casein_page_title = 'News'
  		@news = News.order(sort_order(:title)).paginate :page => params[:page]

SELECT  "news".* FROM "news"  WHERE "news"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      @casein_page_title = 'View news'
      @news = News.find params[:id]

INSERT INTO "news" ("body", "created_at", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
      @news = News.new news_params

      if @news.save

SELECT  "news".* FROM "news"  WHERE "news"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "news" SET "body" = ?, "image_url" = ?, "title" = ?, "updated_at" = ? WHERE "news"."id" = 1  [["body", ""], ["image_url", ""], ["title", ""], ["updated_at", "2014-09-19 20:08:23.830530"]]
---
    def update
      @casein_page_title = 'Update news'

      @news = News.find params[:id]

      if @news.update_attributes news_params

SELECT  "news".* FROM "news"  WHERE "news"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 1]]
---
    def destroy
      @news = News.find params[:id]

      @news.destroy