app/controllers/home_controller.rb

  def news
  	@news = News.all
---
SELECT "news".* FROM "news"

  def information
  	@informations = Information.all
---
SELECT "information".* FROM "information"